rpc/test_data/set_parameter_values_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
    <soapenv:Header>
        <cwmp:ID soapenv:mustUnderstand="1">123</cwmp:ID>
    </soapenv:Header>
    <soapenv:Body>
        <cwmp:SetParameterValues>
            <ParameterList soapenc:arrayType="cwmp:ParameterValueStruct[2]">
                <ParameterValueStruct>
                    <Name>Device.ManagementServer.ConnectionRequestUsername</Name>
                    <Value xsi:type="xsd:string">G3000E-9799109101</Value>
                </ParameterValueStruct>
                <ParameterValueStruct>
                    <Name>Device.ManagementServer.ConnectionRequestPassword</Name>
                    <Value xsi:type="xsd:string">secret</Value>
                </ParameterValueStruct>
            </ParameterList>
            <ParameterKey>n/a</ParameterKey>
        </cwmp:SetParameterValues>
    </soapenv:Body>
</soapenv:Envelope>
